public/app/Helpers/osce_helper.php

SELECT *
FROM "config"
WHERE "configNama" = 'getNamaApp'
---
function getNamaApp()
{
    $configSet = new \Modules\ConfigSet\Models\ConfigSetModel;
    $result = $configSet->getWhere(['configNama' => 'getNamaApp'])->getResult()[0]->configValue;

SELECT *
FROM "config"
WHERE "configNama" = 'getGambarApp'
---
function getGambarApp()
{
    $configSet = new \Modules\ConfigSet\Models\ConfigSetModel;
    $result = $configSet->getWhere(['configNama' => 'getGambarApp'])->getResult()[0]->configValue;

SELECT *
FROM "penguji"
WHERE "pengujiId" = '1'
---
function getDetailSet($id)
{
    $penguji = new \Modules\Penguji\Models\PengujiModel;
    $result = $penguji->getPengujiById($id)->getResult();